cases/e1_rouaix_case1_static/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (70 0 0);

boundaryField
{
    nozzle
    {
        type            fixedValue;
        value           uniform (0 -10 0);
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform (70 0 0);
    }

    aircraftWall
    {
        type            noSlip;
    }

    downstreamOutlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (70 0 0);
        value           uniform (70 0 0);
    }

    bottomOutlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (70 0 0);
        value           uniform (70 0 0);
    }

    spanwiseMinus
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (70 0 0);
        value           uniform (70 0 0);
    }

    spanwisePlus
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (70 0 0);
        value           uniform (70 0 0);
    }
}
