cases/e1_rouaix_case1_static/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.6978974178;

boundaryField
{
    nozzle
    {
        type            fixedValue;
        value           uniform 0.0107810420;
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform 3.6978974178;
    }

    aircraftWall
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }

    downstreamOutlet
    {
        type            inletOutlet;
        inletValue      uniform 3.6978974178;
        value           uniform 0;
    }

    bottomOutlet
    {
        type            inletOutlet;
        inletValue      uniform 3.6978974178;
        value           uniform 0;
    }

    spanwiseMinus
    {
        type            inletOutlet;
        inletValue      uniform 3.6978974178;
        value           uniform 0;
    }

    spanwisePlus
    {
        type            inletOutlet;
        inletValue      uniform 3.6978974178;
        value           uniform 0;
    }
}
