cases/e1_rouaix_case1_static/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.735;

boundaryField
{
    nozzle
    {
        type            fixedValue;
        value           uniform 0.015;
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform 0.735;
    }

    aircraftWall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    downstreamOutlet
    {
        type            inletOutlet;
        inletValue      uniform 0.735;
        value           uniform 0;
    }

    bottomOutlet
    {
        type            inletOutlet;
        inletValue      uniform 0.735;
        value           uniform 0;
    }

    spanwiseMinus
    {
        type            inletOutlet;
        inletValue      uniform 0.735;
        value           uniform 0;
    }

    spanwisePlus
    {
        type            inletOutlet;
        inletValue      uniform 0.735;
        value           uniform 0;
    }
}
