cases/e1_rouaix_case1_static/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    nozzle
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    gasInlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    aircraftWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    downstreamOutlet
    {
        type            prghPressure;
        p               uniform 0;
        rho             rho;
        value           uniform 0;
    }

    bottomOutlet
    {
        type            prghPressure;
        p               uniform 0;
        rho             rho;
        value           uniform 0;
    }

    spanwiseMinus
    {
        type            prghPressure;
        p               uniform 0;
        rho             rho;
        value           uniform 0;
    }

    spanwisePlus
    {
        type            prghPressure;
        p               uniform 0;
        rho             rho;
        value           uniform 0;
    }
}
