cases/e1_rouaix_case1_static/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

phases (water air);
water
{
    transportModel Newtonian;
    nu 8.91138772955092e-07;
    rho 997.6;
}
air
{
    transportModel Newtonian;
    nu 1.57627118644068e-05;
    rho 1.18;
}
sigma 0.072;
