cases/e1_rouaix_case1_static/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Provisional variable-density selection pairs with rhoPhi turbulence schemes.
// The pinned v2512 selector otherwise defaults to uniform density and phi.
density variable;
simulationType RAS;
RAS
{
    RASModel realizableKE;
    turbulence on;
    printCoeffs on;
}
