cases/e1_rouaix_case1_static/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p_rgh { solver GAMG; tolerance 1e-8; relTol 0.01; smoother DICGaussSeidel; maxIter 100; }
    p_rghFinal { $p_rgh; relTol 0; }
    "(U|k|epsilon)"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-8;
        relTol 0.1;
        nSweeps 2;
        maxIter 100;
    }
    "(U|k|epsilon)Final"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-8;
        relTol 0;
        nSweeps 2;
        maxIter 100;
    }
    "alpha.*"
    {
        isoFaceTol 1e-10;
        surfCellTol 1e-10;
        nAlphaBounds 5;
        snapTol 0;
        clip true;
        cAlpha 1;
        nAlphaSubCycles 1;
        reconstructionScheme isoAlpha;
    }
}
PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}
