cases/e1_rouaix_case1_static/case/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

expressions
(
    hydrostaticAirPressure
    {
        field p_rgh;
        dimensions [1 -1 -2 0 0 0 0];
        expression #{ 1.18*9.81*pos().y() #};
    }
);
