cases/e1_rouaix_case1_static/case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name nozzleFaces;
        type faceSet;
        action new;
        source patchToFace;
        patch aircraftWall;
    }
    {
        name nozzleFaces;
        type faceSet;
        action subset;
        source cylinderToFace;
        point1 (0 -0.1 0);
        point2 (0 0.1 0);
        radius 0.2;
    }
);
